<?php
$o = 4;
$r = 3;
if($o != $r){
    echo "Не равно<br>";
}
else{
    echo "Равно<br>";
}

$o = 4;
$r = 3;
if($o == $r){
    echo "Равно<br>";
}
else{
    echo "Не равно<br>";
}

$o = 4;
$r = 4;
if($o == $r){
    echo "Равно<br>";
}
else{
    echo "Не равно<br>";
}
/*Двойниє условія і значення для зрівняння and -&&-i; or-||-ілі; <- Більше >-Менше <= >=  */

$o = 4;
$r = 4;
$g = 9;
$d = 17;
if($o != $r || $g!=$d){
    echo "Равно<br>";
}
else{
    echo "Не равно<br>";
}


/*Встроєні конструкції if else*/
$o = 5;
$r = 4;
$g = 9;
$d = 17;
$w = "Oleg";
$e = "ja";
if($o != $r && $g != $d){
    echo "Не равно<br>";
if ($w != $e)  {
    echo "Ви вели неправильні дані<br>";
}
}
else{
    echo "Равно<br>";
}

$o = 4;
$r = 4;
$g = 9;
$d = 17;
$w = "Oleg";
$e = "ja";
if($o != $r && $g != $d){
    echo "Не равно<br>";
    if ($w != $e)  {
        echo "Ви вели неправильні дані<br>";
    }
}
else{
    echo "Равно<br>";
}
?>